# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали n журавликов.

# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали
#  одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем 
# Петя и Сережа вместе?

# Выведите через пробел количество журавликов, сделанных Петей, Катей и Сережей.


# Петя = Сережа
# Катя = 2*(Петя + Сережа) = 2 * 2 * Петя
# Всё = Петя + Сережа + Катя = Петя + Петя + 4 * Петя
# Всё/6 = Петя

# Петя = Всё/6
# Сережа  = Всё/6
# Катя = 2*(Всё/6 + Всё/6) = Всё * 2/3

