# Задача 4: Требуется определить, можно ли от шоколадки размером n
# × m долек отломить k долек, если разрешается сделать один разлом по
# прямой между дольками (то есть разломить шоколадку на два
# прямоугольника).

# 3 2 4 -> yes
# 3 2 1 -> no

n = 1
m = 6

for k in range(1,20):
    if ((k % n == 0 or k % m == 0) and k < m * n):
        print(f"k = {k} | n = {n} m = {m} || YES")
    # else:
    #     print(f"k = {k} n = {n} m = {m} || NO")