# Задача №2. Решение в группах
# В некоторой школе решили набрать три новых
# математических класса и оборудовать кабинеты для
# них новыми партами. За каждой партой может сидеть
# два учащихся. Известно количество учащихся в
# каждом из трех классов. Выведите наименьшее
# число парт, которое нужно приобрести для них.
# Input: 20 21 22(ввод чисел НЕ в одну строку)
# Output: 32

a = 20 ; b = 21; c = 22
a1 = (a % 2 == 0) * (a// 2 ) +  (a % 2 != 0) * ((a - 1 )// 2 + 1)
b1 = (b % 2 == 0) * (b// 2 ) +  (b % 2 != 0) * ((b - 1 )// 2 + 1)
c1 = (c % 2 == 0) * (c// 2 ) +  (c % 2 != 0) * ((c - 1 )// 2 + 1)
result = a1 + b1 + c1
print(result)
