
# Задача №2. Решение в группах
# Дано натуральное число A > 1. Определите, каким по
# счету числом Фибоначчи оно является, то есть
# выведите такое число n, что φ(n)=A. Если А не
# является числом Фибоначчи, выведите число -1.
# Input: 5
# Output: 6


A = 13
count = 3
a = 1
b = 1

while True:
    i = a + b
    a = b
    b = i
    count+=1
    if i < A:
        continue
    elif i == A:
        print(count)
        break
    elif i > A:
        print(-1)
        break


