# Задача №4. Решение в группах
# 15. Иван Васильевич пришел на рынок и решил
# купить два арбуза: один для себя, а другой для тещи.
# Понятно, что для себя нужно выбрать арбуз
# потяжелей, а для тещи полегче. Но вот незадача:
# арбузов слишком много и он не знает как же выбрать
# самый легкий и самый тяжелый арбуз? Помогите ему!
# Пользователь вводит одно число N – количество
# арбузов. Вторая строка содержит N чисел,
# записанных на новой строчке каждое. Здесь каждое
# число – это масса соответствующего арбуза
# Input: 5 -> 5 1 6 5 9
# Output: 1 9
import random
N = 5
list1 = []

for i in range(N):
    list1.append(random.randint(1,9))
print(list1)

max,min = list1[0],list1[0]

for i in range(N):
    if i == 0:
        continue
    elif max < list1[i]:
        max = list1[i]
    elif min > list1[i]:
        min = list1[i] 

print(f"max {max} , min {min}")

