# Задача 2: Петя и Катя – брат и сестра. Петя – студент, а Катя –
# школьница. Петя помогает Кате по математике. Он задумывает два
# натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для
# этого Петя делает две подсказки. Он называет сумму этих чисел S и их
# произведение P. Помогите Кате отгадать задуманные Петей числа.

# 4 4 -> 2 2
# 5 6 -> 2 3

import math as mt

x,y = None,None
# print(x,y)
S = 9
P = 6

# x = S - y
# S - y * y = P
# Sy - y2 = P

# y2-Sy + P = 0

d = S * S - 4 * P
if d == 0:
    x,y = S/2,S/2
elif d > 0:
    x,y = (S + mt.sqrt(d)) / 2 , (S - mt.sqrt(d)) / 2
else:
    x,y = None,None

print(f"x = {x}, y = {y}")