# Задача №3. Решение в группах
# Напишите программу для печати всех уникальных
# значений в словаре.
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII
# ":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}
# Примечание: Список словарей задан изначально.
# Пользователь его не вводит

list1 = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},{"VI": "S005"},
        {"VII": " S005 "}, {" V ":" S009 "}, {" VIII":" S007 "}]

list2 = []

for i in list1:
    for key,value in i.items():
            a = ""
            for i in value:
                if i != " ":
                    a+=i
            list2.append(a)

print(set(list2)) 
                    
            
