# ДОП задание Поход желанию

# Три друга взяли вещи в поход. Имеется словарь, где ключ - имя друга, а значение - кортеж вещей. Ответьте на вопросы:

# какие вещи взяли все три друга - "спички"

# какие вещи уникальны, есть только у одного друга - Лиза взяла косметичку, Вася взял топор, Ваня взял еду

# какие вещи есть у всех друзей кроме одного и имя того, у кого данная вещь отсутствует - у Лизы нет спальника,

# Код должен расширяться на любое большее количество друзей.

# hike = {
# 'Вася': ("спички", "спальник", "дрова", "топор"),
# 'Ваня': ("спальник", "спички", "вода", "еда"),
# 'Лиза': ("вода", "спички", "косметичка"),
# }