# Задача 4. Посчитай чужую зарплату...
# Бухгалтер устала постоянно считать вручную среднегодовую зарплату
# сотрудников компании и, чтобы облегчить себе жизнь, обратилась к
# программисту.
# Напишите программу, которая принимает от пользователя зарплату сотрудника
# за каждый из 12 месяцев и выводит на экран среднюю зарплату за год.


import random

list1 = []
N = 12
for i in range(N):
    list1.append(random.randint(30000,50000))
print(list1)

sum = 0
result = None
for i in list1:
    sum +=i
result = sum//12

print(result)