# Задача 3. Сортировка
# Дан список из N чисел. Напишите программу, которая сортирует элементы
# списка по возрастанию и выводит их на экран. Дополнительный список
# использовать нельзя.
# Также нельзя использовать готовые функции sorted/min/max и метод sort
# Постарайтесь придумать и написать как можно более эффективный алгоритм
# сортировки.
# Пример:
# Изначальный список: [1, 4, –3, 0, 10]
# Отсортированный список: [–3, 0, 1, 4, 10]


list1 = [1,4,-3,0,10]
min = list1[0]
for i in range(len(list1)):
    for k in range(len(list1)):
        if list1[i] <= list1[k]:
            a = list1[k]
            list1[k] = list1[i]
            list1[i] = a

print(list1)

