# Задача 5. Пицца
# В базе данных интернет-магазина PizzaTime хранятся сведения о том, кто, что и
# сколько заказывал у них в определённый период. Вам нужно структурировать
# эту информацию и определить, сколько всего пицц купил каждый заказчик.
# На вход в программу подаётся N заказов. Каждый заказ представляет собой
# строку вида «Покупатель — название пиццы — количество заказанных пицц».
# Реализуйте код, который выводит список покупателей и их заказов по
# алфавиту. Учитывайте, что один человек может заказать одну и ту же пиццу
# несколько раз.
# Пример
# Введите количество заказов: 6
# Первый заказ: Иванов Пепперони 1
# Второй заказ: Петров Де-Люкс 2
# Третий заказ: Иванов Мясная 3
# Четвёртый заказ: Иванов Мексиканская 2
# Пятый заказ: Иванов Пепперони 2
# Шестой заказ: Петров Интересная 5
# Иванов:
# Мексиканская: 2
# Мясная: 3
# Пепперони: 3
# Петров:
# Де-Люкс: 2
# Интересная: 5

list1 = ["Иванов Пепперони 1","Петров Де-Люкс 2","Иванов Мясная 3",
        "Иванов Мексиканская 2","Иванов Пепперони 2","Петров Интересная 5"]
listOrder = []
Buffer = ''
number = 1
order = {0:'',1:'',2:''} #name (1),pizza (2),count (3)

name = ''
pizza = ''
count = ''

cou = 0
for string in list1:
    for i in range(len(string)):
        if string[i] != ' ' and i != len(string)-1:
            name+=string[i]
        else:
            if i == len(string)-1:
                name+=string[i]
            order[cou] = name
            # print(f"{name}",end = " ")
            name = ''
            cou +=1
            if cou >= 3:
                # print()
                cou = 0
                a = order.copy()
                listOrder.append(a)

listOrderResult = []


for dict in listOrder:
    for ditus in range(len(listOrder)):
        if (dict[0] and dict[1] == listOrder[ditus][0] and listOrder[ditus][1]):
            print("none")
            

    
 


print(listOrder)






