# Задача №4. Решение в группах
# Дан массив, состоящий из целых чисел. Напишите
# программу, которая подсчитает количество
# элементов массива, больших предыдущего (элемента
# с предыдущим номером)
# Input: [0, -1, 5, 2, 3]
# Output: 2 (-1 < 5, 2 < 3)
# Примечание: Пользователь может вводить значения
# списка или список задан изначально.


list1 = [0, -1, 5, 2, 3]
count = 0
for i in range(len(list1)):
    # print(f"list[i] {list1[i]}, list1[i - 1] {list1[i - 1]}")

    if list1[i] < list1[i - 1] and i != 0:
        count+=1

print(count)