# Задача 1: Требуется вычислить, сколько раз встречается некоторое
# число X в массиве A[1..N]. Пользователь в первой строке вводит
# натуральное число N – количество элементов в массиве. В последующих
# строках записаны N целых чисел Ai
# . Последняя строка содержит число X
# 5
# 1 2 3 4 5
# 3
# -> 1

import random

N = 6
list1 = [random.randint(-10,10) for i in range(N)]
list2 = [1,1,3,4,5]

X = 1
count = 0
for i in list2:
    if X == i:
        count+=1
print(count)


