# Задача 1 
# За день машина проезжает n километров. Сколько дней нужно , что бы проехать маршрут длиной m
# километров? При решении этой задачи нельзя пользоваться инструкцией if и циклами 

n = 1

m = 1

result = m//n 

print(result)